package ui;

public class StoryDialog {

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                       PRE_DAY0: ก่อนเริ่มงาน                         ║
    // ╚══════════════════════════════════════════════════════════════════════╝
    
    /* ------------------------------------------------------------------
        [CUTSCENE] : CG1-JobApplication
        [NOTE]     : CG แม่ยื่นใบสมัครงานให้
       ------------------------------------------------------------------ */
    public static final String[] PRE_DAY0_CG1 = {
        "แม่ของคุณนำใบสมัครงานจากบริษัทเกมเล็ก ๆ มาให้",
        "บริษัทนี้เป็นสาขาย่อยที่เพิ่งเปิดใหม่ และกำลังขาดคนด้านเครือข่ายอย่างเร่งด่วน",
        "ตำแหน่งที่เปิดรับคือ Network Engineer",
        "คุณจึงตัดสินใจลองสมัครไป แม้จะยังไม่รู้รายละเอียดของบริษัทมากนัก"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : CG2-JobInterview
        [NOTE]     : CG interview
       ------------------------------------------------------------------ */
    public static final String[] PRE_DAY0_CG2 = {
        "เหมือนว่าการสัมภาษณ์จะผ่านไปอย่างราบรื่น แล้วก็ถึงเวลาพบหัวหน้างานคนใหม่เป็นครั้งแรก",
        "คุณเดินเข้ามาในสำนักงานขนาดเล็ก",
        "บรรยากาศเงียบกว่าที่คิด โต๊ะทำงานมีไม่กี่ตัว",
        "คุณเคาะประตู",
        "**เสียงเคาะประตู**",
        "???: อืม… เข้ามาได้",
        "คุณเดินเข้าไปห้องของหัวหน้า เธอกำลังอ่านเอกสารอยู่",
        "**เพลงที่ดูซีเรียส จริงจัง**",
        "Luca: สวัสดีครับ",
        "???: นั่งลงก่อนสิ",
        "คนคนนั้นมองเอกสารของคุณอยู่อีกสักพัก",
        "???: น่าตกใจนะเนี่ย ที่คนที่เคยทำงานบริษัทใหญ่มาก่อนจะมาทำงานกับเรา…",
        "???: ขอแนะนำตัวก่อนนะ ฉันชื่อ \"Momoka\" เป็นหัวหน้าของนาย",
        "Momoka: นายคงจะรู้อยู่แล้วว่า ตำแหน่ง Network Engineer ต้องทำอะไรบ้าง",
        "Momoka: นายก็ต้องตั้งค่า IP, ต่อ LAN, ตรวจ Log จาก Server แล้วก็จัดการ User Management นายทำได้รึเปล่า?",
        "Luca: จะพยายามเต็มที่ครับ",
        "Momoka: ดีมาก ถึงยังไงนี่ก็เป็นสาขาย่อยที่เพิ่งเปิดใหม่ ก็คงมีระบบที่ยังไม่เรียบร้อยที่ต้องให้นายจัดการอีกเยอะเลย",
        "Momoka: งั้นก็ขอต้อนรับสู่บริษัทเกมของพวกเรานะ คุณ…",
        "Momoka: …",
        "Luca: ?",
        "Momoka: คุณ… คุณ… Lu… อะไรนะ??? เอ่อ… คุณ…",
        "Luca: Luca ครับ",
        "**ขึ้นเพลงมีมๆ**",
        "Momoka: ใช่! คุณ Luca ยินดีต้อนรับน้าา",
        "Momoka: เอ่อ… แฮะๆ ไม่ใช่ว่าลืมหรืออะไรหรอกนะ ก็ฉันเป็นหัวหน้านี่เนอะ! จะไปลืมได้ไงก่อนน",
        "Luca: …ครับ",
        "หัวหน้า Momoka แสดงสีหน้าท่าทีลนลานเหมือนคนทำอะไรไม่ถูกอยู่สักพัก",
        "ก่อนจะทำตาโตเหมือนนึกขึ้นได้แล้วหยิบหนังสือเล่มหนึ่งจากลิ้นชักยื่นให้คุณ",
        "Luca: นี่อะไรหรอครับ?",
        "Momoka: Textbook รายละเอียดงานน่ะ เอาไปสิ",
        "Momoka: เพราะนายต้องเข้าเวรกะดึกตั้งแต่เที่ยงคืน - หกโมงเช้า เลยไม่มีคนสอนงาน มันคงพอช่วยอะไรได้บ้าง…",
        "Momoka: …",
        "Luca: หัวหน้า?",
        "Momoka: อ๋าา จริงด้วย! วันนี้ฉันต้องพานายไปทัวร์บริษัทนี่นา!",
        "Luca: อ่า ครับ",
        "Momoka: แต่ฉันนัดเพื่อนไปก๊งเหล้- เอ้ย! ไม่ใช่ๆ พอดีฉันมีธุระสำคัญน่ะสิ…",
        "Momoka: เพราะงั้น…",
        "หัวหน้า Momoka หยิบกระดาษที่ดูเหมือนจะเป็นแผนที่แนบใส่ Textbook ของคุณ",
        "Momoka: เริ่มงานมะรืนนี้ก็ขอฝากด้วยนะ คุณ Luca",
        "Luca: ครับ ไม่มีปัญหาครับ!",
        "Momoka: อุตส่าท่องมาลืมจนได้ มาดหัวหน้าสุดเท่ฉัน เฮ้อ",
        "Luca: ...วันนี้ก็ขอบคุณมากนะครับ"
    };

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                            OFFICE_DAY1                               ║
    // ╚══════════════════════════════════════════════════════════════════════╝

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ lift1
       ------------------------------------------------------------------ */
    public static final String[] DAY1_LIFT1 = {
        "คุณมาถึงบริษัทก่อนเวลาเริ่มงาน",
        "สำนักงานกำลังจะปิดไฟ",
        "Luca: เอ่อ…พึ่งเคยมาครั้งแรกซะด้วยสิเรา",
        "Luca: คิดว่า textbook น่าจะพอช่วยอะไรได้นะ",
        "ในแต่ละวันจะมีภารกิจที่ต้องทำแสดงขึ้นมา",
        "แต่ต้องระวังไว้ให้ดีเพราะมีบางภารกิจที่ \"จำกัดเวลา\" ในการทำ",
        "ส่วนช่วงที่ไม่มีภารกิจคุณจะสามารถเดินสำรวจและพูดคุยกับเพื่อนร่วมงานได้อย่างอิสระ",
        "ใน textbook ที่หัวหน้าได้แนบแผนที่บริษัทเอาไว้",
        "คุณสามารถเปิด textbookได้ด้วยการกด M",
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ chiefoffice
       ------------------------------------------------------------------ */
    public static final String[] DAY1_CHIEFOFFICE = {
        "Luca: สวัสดีครับ",
        "Momoka: ว่าไงมาแล้วหรอ",
        "Momoka: โทษทีเรื่องคราวก่อนนะ แฮะๆ",
        "Momoka: นี่งานวันนี้ของนาย",
        "Momoka: ปกติฉันไม่ได้อยู่กะดึก ที่เจอนายวันนี้เพื่อแนะนำเท่านั้น",
        "Momoka: แล้วก็ไปทักทายเพื่อนร่วมงานของนายด้วยล่ะ",
        "Momoka: เขาอยู่ชั้น 2 ห้อง IT Support ถ้าไม่เข้าใจตรงไหนก็ถามเขาได้เลย",
        "Luca: เข้าใจแล้วครับ ขอบคุณมากนะครับ"
    };

    /* ------------------------------------------------------------------
        [EVENT]: ถ้าช่วยจัดเอกสาร ครั้งที่ 1
       ------------------------------------------------------------------ */
    public static final String[] DAY1_CHIEFOFFICE_HELP = {
        "Momoka: โอ้โห นี่จัดให้ด้วยหรอ เยี่ยมเลย",
        "Momoka: ใบนี้นี่แหละที่หาอยู่ตั้งนาน ช่วยได้มากเลยนะเนี่ย เกือบแย่ๆ",
        "Momoka: โอ๊ะ! คิดอะไรดีๆออกแล้ว แวะมาอีกบ่อยๆเลยก็ได้นะเดี๋ยวเลี้ยงกาแฟ"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ office
       ------------------------------------------------------------------ */
    public static final String[] DAY1_OFFICE = {
        "คุณพบผู้หญิงคนหนึ่งกำลังเก็บของกลับบ้าน",
        "???: สวัสดีค่ะ มาทำงานวันแรกท่าทางราบรื่นดีนะคะ",
        "Luca: นั่นสินะครับ",
        "???: ถ้าคุณได้ทำงานกะเช้า ก็คงจะได้เจอกันบ่อยๆนะคะ น่าเสียดายที่ได้งานมาเข้ากะดึกนะคะ",
        "???: แต่ก็ไม่รู้ทำไมคนมีความสามารถ เคยทำบริษัทดีๆมาก่อนอย่างคุณ ถึงมาทำที่นี่นะคะ",
        "Luca: ?…ขอบคุณนะครับ โอ๊ะ! ผม Luca นะครับขอฝากตัวด้วย",
        "เธอนิ่งไป ใบหน้าเริ่มเปลี่ยนเป็นสีแดงอมชมพู คิ้วเริ่มขมวดต่ำลง",
        "???: …",
        "???: ฉันรู้ค่ะ",
        "Luca: เอ๋? รู้ได้ยังไง…",
        "???: หึ! ก็ฉันเป็นคนสัมภาษณ์คุณเองนี่คะ แต่เหมือนว่าคุณจะจำฉันไม่ได้นะคะ",
        "Luca: อ๊ะ ยังไงก็ขอโทษด้วยนะครับ จำไม่ได้จริงๆ…",
        "???: ฉันไม่คิดมากกับเรื่องๆเล็กๆน้อยๆหรอกค่ะ ",
        "???: ยังไงได้งานมาแล้วก็จัดการเน็ตหน่อยนะคะ  วันนี้มันช้ามาก จนทำการทำงานอะไรไม่ได้เลย",
        "Luca: งั้นหรอครับ… ได้ครับ เดี๋ยวผมลองดูให้",
        "???: ถอนหายใจ",
        "???: งานฉันก็เยอะจะตายอยู่แล้ว",
        "???: ถ้ายังหมุนทั้งวันอย่างงี้อีก ฉันคงต้องมาทำ OT แล้วเจอหน้าคุณอีกแหงเลยค่ะ",
        "???: แล้วก็ฉัน Lauren ค่ะ จำชื่อกับหน้าฉันไว้หน่อยก็ดีนะคะ ฉันกลับล่ะค่ะ",
        "Luca: (แย่จังเลยแฮะ ปกติเราจำหน้าคนได้แม่นแท้ๆ…)",
        "Luca: (ไม่เป็นไรๆ ไปทำงานของเราให้ดีกันเถอะ!)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ itsupport
       ------------------------------------------------------------------ */
    public static final String[] DAY1_ITSUPPORT = {
        "คุณเดินไปที่ห้อง IT Support",
        "ชายคนหนึ่งกำลังมองจอคอมพิวเตอร์นิ่ง ๆ",
        "Luca: สวัสดีครับ",
        "???: อ๋อ… นายคือคนใหม่ที่หัวหน้าบอก",
        "Luca: ใช่ครับ ผมชื่อ Luca ครับ! ผมจะพยายามเต็มที่เลยครับ",
        "???: อ่า มาใหม่ๆก็พูดแบบนั้นกันทั้งนั้น…",
        "Luca: แล้วคุณชื่ออะไรหรอครับ?",
        "???: \"Wei\"",
        "Wei: ถ้ามีปัญหาอะไร…อย่าโทษ IT Support ก็พอ",
        "Wei: อ่อ…จริงด้วย…หัวหน้าฝากมา",
        "คุณได้รับ Keycard เข้าห้อง server",
        "Luca: ขอบคุณนะครับ",
        "แล้วเขาก็เงียบไปนาน เหมือนกำลังเหม่อลอย",
        "Luca: (อย่าไปกวนเขาเลยจะดีกว่า…)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ art
       ------------------------------------------------------------------ */
    public static final String[] DAY1_ART = {
        "???: โอ๊ะ พนักงานใหม่สินะครับ",
        "Luca: อ่า ใช่ครับ",
        "???: กระผมทำงานกะดึกทุกวัน ไม่คุ้นหน้าคุณ ก็เลยคาดว่ามาใหม่น่ะครับ ",
        "???: ขออนุญาตแนะนำตัวกระผมชื่อ \"Shu\" ทำงานในฐานะภารโรงช่วงกะดึก",
        "Shu: เราคงจะได้เจอกันอีกบ่อยๆเลยนะครับ",
        "Shu: อืม…คุณคงจะเป็นคนดูแลอินเทอร์เน็ตสินะครับ",
        "Luca: ก็ประมาณนั้นแหละครับ…",
        "Luca: (ว่าแต่เขารู้ได้ไงเนี่ย)",
        "Shu: คงจะคิดว่ากระผมรู้ได้ยังไงสินะครับ",
        "Luca: เอ๊ะ! อ่า…ก็สงสัยอยู่นิดหน่อยครับ…",
        "Shu: หืม…ก็หัวหน้าสาขา Momoka น่ะสิครับ ไล่อวดไปทั่วเลยว่ามีพนักงานเก่งๆเข้าบริษัทเรา",
        "Shu: กับบริษัทสาขาย่อยเล็กๆที่เพิ่งเปิดไม่ถึง 6 เดือนมันก็คงดีใจนั่นแลครับ",
        "Luca: โดนชมบ่อยๆจนเริ่มจะเกร็งแล้วนะครับเนี่ย",
        "Shu: แหมๆ ไม่ต้องเครียดขนาดนั้นก็ได้ครับ",
        "Shu: …แต่จะว่าไปพอนึกถึงตอนทำความสะอาดห้อง Server นั่นทีไร",
        "Shu: กระผมก็เริ่มจักขนลุกขึ้นมา นั่นมันห้องเก็บฝุ่นขนานแท้เลยนะครับ",
        "Shu: โอ้ว แย่จริงเชียว รั้งคุณไว้เสียนานคงต้องปล่อยคุณไปทำงานแล้วล่ะครับ โชคดีนะครับ",
        "Luca: คุณ Shu เองก็เหมือนกันนะครับ!",
        "Luca: (ถึงจะใช้คำแปลกๆไปหน่อยแต่ก็ท่าทางเป็นคนดีอยู่นะ)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ server
       ------------------------------------------------------------------ */
    public static final String[] DAY1_SERVER = {
        "คุณเข้าไปตรวจ Log ในห้อง Server",
        "คุณพบการอัปโหลดไฟล์แปลก ๆ มาจากแผนก Office",
        "Luca: อะไรเนี่ย? ไม่เหมือนไฟล์งานเลยเผลออัปโหลดผิดรึเปล่านะ",
        "Luca: ไว้ค่อยแจ้งพรุ่งนี้แล้วกัน",
        "คุณคิดว่ายังไม่เป็นปัญหาอะไร",
        "คุณจึงจดบันทึกไว้ใน textbook"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : ชื่อรูป (CG ห้องนอน)
    ------------------------------------------------------------------ */
    public static final String[] DAY1_BEDROOM = {
        "คุณกำลังเข้านอน พลางคิดเรื่องของวันนี้",
        "Luca: วันแรกก็ราบรื่น!",
        "Luca: แต่ไฟล์อันนั้นด้วย คงต้องลองถามคุณ Wei ดูเพราะไม่รู้ว่าใครในแผนกนั้นส่งผิดกันแน่",
        "คุณล้มตัวลงนอนแล้วผล็อยหลับไป",
        "ในความฝันมีคนบอกคุณว่า...",
        "อย่าลืมคุยกับเพื่อนร่วมงานทุกคนที่เจอให้มากๆเข้าไว้เพราะใช่ว่าคนเหล่านั้นจะอยู่กับเราไปตลอด"
    };

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                            OFFICE_DAY2                               ║
    // ╚══════════════════════════════════════════════════════════════════════╝

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ lift1
       ------------------------------------------------------------------ */
    public static final String[] DAY2_LIFT1 = {
        "**เสียงริงโทนโทรศัพท์มือถือ**",
        "Luca: ฮัลโหลครับ",
        "Momoka: …ฮัลโหลๆ อึก นี่ Momoka นะ Luca ",
        "Luca: ครับหัวหน้า",
        "Momoka: …",
        "Luca: หัวหน้า?",
        "Momoka: อ่า…อ๋อ วันนี้ทั้งวันมีคนร้องเรียนเรื่องเน็ตช้าเยอะมากอีกแล้ว อึก ช่วยดูให้หน่อยสิ ",
        "Luca: เอ่อ…เมาอยู่หรอครับ",
        "Momoka: หา??? เปล่าสักหน่อย! แค่กริ่มๆเองง เหอะๆ อึก",
        "Luca: เอ่อ ครับ แล้วพอจะรู้สาเหตุไหมครับ",
        "Momoka: สาเหตุหรอ…อืม ตอนนี้ยังไม่รู้น่ะ ฝากนายหาแล้วแก้เลยแล้วกันน้าา อึก",
        "Momoka: งึมๆ แต่ถ้าไม่รู้จะเริ่มยังไงก็ลองเช็ค Log ย้อนหลังดูสิ วางล่ะ"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ office
       ------------------------------------------------------------------ */
    public static final String[] DAY2_OFFICE = {
        "Luca: สวัสดีครับ คุณ Lauren! วันนี้ผมจำชื่อกับหน้าของคุณได้แล้วนะครับ",
        "Lauren: ก็ดีแล้วล่ะค่ะ จะได้ไม่ไปทักใครผิดเข้า ",
        "Luca: วันนี้คุณ Lauren ก็อยู่ดึกนะครับ",
        "Lauren: ก็นั่นน่ะสิคะ วันนี้ระบบช้ามากจนงานที่ควรจะเสร็จตั้งแต่บ่ายก็เลยมาถึงตอนนี้นี่แหละค่ะ",
        "Luca: อา…แย่เลยนะครับแบบนั้น อย่าฝืนตัวเองมากนะครับ",
        "Lauren: ค่ะ ไหนๆก็ไหนอยากจะรบกวน…คุณ…ไม่สิ",
        "Lauren: เท่าทีฉันอ่านใบสมัครคุณก็อายุน้อยกว่าฉันงั้นฉันขอเรียกคุณว่าน้อง Luca แล้วกันค่ะ",
        "Luca: ได้สิครับ! งั้นผมขอเรียกคุณว่า พี่ Lauren ได้ไหมครับ?",
        "Lauren: ค่ะ… อะแฮ่ม เรื่องที่อยากรบกวนน้อง Luca คือ อยากให้ดูคอมให้หน่อยน่ะค่ะ",
        "Lauren: ช่วงนี้เน็ตช้าตลอดเลย วันนี้เครื่องพี่ค้างไปสามรอบแล้ว",
        "Luca: ผมจะดูให้นะครับ วางใจได้เลย!",
        "Lauren: รบกวนด้วยค่ะ",
        "Lauren: เมื่อคืนมีอะไรแปลกๆไหมคะ?",
        "Luca: ครับ? ปกติครับ อะไรแปลกหรอครับ?",
        "Lauren: อ…อ๋อ เปล่าหรอกค่ะ งั้นฝากดูด้วยนะคะ",
        "เธออำลาแล้วเดินจากไป",
        "Luca: (เรื่องแปลกๆ? อ๊ะ จะว่าไปก็มีไฟล์แปลกๆเมื่อวานนี้ ลืมถามไปซะงั้น)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ itsupport
       ------------------------------------------------------------------ */
    public static final String[] DAY2_ITSUPPORT = {
        "Wei: มีเรื่องแปลก…",
        "Luca: อะไรหรอครับ?",
        "Wei: คืนเมื่อวานเครื่องของอาเจ๊",
        "Wei: เปิดตั้งแต่เช้ามืด",
        "Wei: แต่อาเจ๊บอกไม่ได้เปิดทิ้งไว้",
        "Luca: อาเจ๊?",
        "Wei: ผมน้ำเงินๆ กระเป๋าชมพู…",
        "Luca: อ๋อ คุณ Lauren น่ะหรอครับ",
        "Wei: อืม…",
        "Luca: แต่เมื่อวานผมก็คุยกับเธอก่อนเธอจะกลับนะครับ ก็เห็นเครื่องปิดแล้วนี่นา",
        "Wei: ไปดูหน่อยสิ…เช็คเน็ตไปด้วยเลย…",
        "Luca: หืม? อ๋อ ได้ครับ!"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ office 
       ------------------------------------------------------------------ */
    public static final String[] DAY2_OFFICE_CHECK = {
        "Luca: ไหนดูหน่อย…",
        "**เสียงคลิกเม้า แป้นพิมพ์**",
        "Luca: เอ้า? เครื่องเปิดอยู่แฮะ ลืมปิดติดกัน 2 วันซะงั้น",
        "Luca: อ่าา ต้องเช็คเน็ตด้วยสินะ งั้นดู IP กับ DNS ละกัน",
        "Luca: หืม?",
        "คุณพบว่าเครื่องถูกตั้ง Static IP และ DNS ถูกเปลี่ยน",
        "Luca: แต่จาก textbook เครื่องนี้เลขมันไม่ตรงกันนี่",
        "Luca: ทำไมถึงเปลี่ยนเลขกันล่ะ?",
        "Luca: งั้นจำเอาไว้ก่อนแล้วค่อยไปถามละกัน"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ server
       ------------------------------------------------------------------ */
    public static final String[] DAY2_SERVER = {
        "Luca: การเชื่อมต่อแปลกๆนี้..",
        "Luca: เมื่อวานยังไม่มีเลยหนิ?",
        "คุณพบการเชื่อมต่อแปลก ๆ",
        "คุณตรวจตู้ Network",
        "Luca: สาย LAN นี่เมื่อวานก็ยังไม่มี…",
        "คุณพบสาย LAN ที่ไม่ได้อยู่ในผังระบบ",
        "คุณจดหมายเลขพอร์ตไว้"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR00 @ meeting
       ------------------------------------------------------------------ */
    public static final String[] DAY2_MEETING = {
        "Luca: สวัสดีครับ",
        "Shu: หืม? คิดว่าใครที่แท้ก็คุณนี่เอง",
        "Shu: แล้ววันนี้เป็นอย่างไรบ้างล่ะครับ?",
        "Luca: อืมม เหมือนวันนี้เน็ตจะไม่ค่อย หัวหน้าเลยให้ผมหาวิธีแก้ แต่ตอนนี้ก็ยังไม่เจอเลยน่ะครับ",
        "Shu: หืม…เมาอยู่สินะครับ เธอคนนั้นน่ะ",
        "Luca: เอ๊ะ รู้ได้ยังไงครับเนี่ย",
        "Shu: แค่มองใบหน้าคุณก็รู้แล้วล่ะครับ",
        "Luca: เอ๋??? นี่ผมดูออกง่ายขนาดนั้นเลยหรอ…",
        "Shu: คิกๆ ไม่เลยครับ คุณน่ะดูซับซ้อนกว่าที่เห็นมาก",
        "Shu: กระผมเพียงแค่คาดเดาเท่านั้นเองครับ",
        "Shu: แต่กระผมต้องพูดอะไรสักหน่อย",
        "Shu: ถึงหัวหน้าสาขาจะดูเป็นอย่างนั้น ก็อย่าไปเอาความเธอเลยนะครับ ",
        "Shu: เพราะว่าที่จริงแล้วเธอน่ะ… ยื่นหูมาใกล้ๆสิครับ… ",
        "Luca: เอ๋!!! 39 ทั้งๆที่ดูหน้าเด็กแบบนั้นน่ะหรอครับ",
        "Luca: (เหลือจะเชื่อ! กินอะไรเข้าไปให้ได้งี้)",
        "Shu: ชู่วว เพราะงั้นอย่าไปถือโทษเธอเลยนะครับ",
        "Shu: เธอคงอย่างใช้ชีวิตวัยรุ่นอันน้อยนิดให้คุ้มค่าที่สุดน่ะครับ",
        "Shu: เก็บไว้เป็นความลับนะครับ",
        "Luca: อ…อ๋อครับ"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : ชื่อรูป (CG ห้องนอน)
    ------------------------------------------------------------------ */
    public static final String[] DAY2_BEDROOM = {
        "Luca: ทั้งไฟล์แปลกๆจากเมื่อวาน",
        "Luca: แล้วยังมีคอมที่ถูกเปลี่ยนหมายเลข กับสาย LAN วันนี้อีก",
        "Luca: เริ่มมีเรื่องแปลกๆเยอะขึ้นเรื่อยๆเลย…",
        "Luca: ถ้าดู Log ต่อไปเรื่อยๆล่ะก็น่าจะมีจุดผิดสังเกตอีกนะ",
        "Luca: แล้วก็ต้องรายงานหัวหน้าเรื่องนี้ด้วย",
        "ในความฝันมีคนบอกคุณว่า...",
        "บางทีถ้าคุณช่วยเหลืองานเล็กๆน้อย อาจจะเกิดเรื่องบางอย่างกับคุณก็ได้นะ..."
    };

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                            OFFICE_DAY3                               ║
    // ╚══════════════════════════════════════════════════════════════════════╝

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ lift1
       ------------------------------------------------------------------ */
    public static final String[] DAY3_LIFT1 = {
        "คุณเจอหัวหน้า Momoka อยู่ที่ทางเข้า",
        "Luca: โอ๊ะ หัวหน้า สวัสดีครับ!",
        "Momoka: ดีจ้า Momoka เอง วันนี้ต้องทำ OT อะฮืออ",
        "Luca: อ่า…ฮะๆ งั้นหรอครับ",
        "Luca: อ๋า ใช่ๆผมมีเรื่องสำคัญที่ต้องบอกหัวหน้าครับ",
        "Momoka: หืมๆ เรื่องอะไรๆ",
        "Luca: 2 วันก่อนผมเจอไฟล์แปลกๆอันนึงใน Log ครับ",
        "Momoka: อืมมมม คงจะส่งไฟล์ผิดล่ะมั้ง?",
        "Luca: …แล้วก็เมื่อวานเองก็มีคอมที่เลข IP ถูกเปลี่ยนเป็น Static กับ DNS ไม่ตรงกับใน textbook น่ะครับ",
        "Momoka: อืมมมม คงจะตั้งค่าผิดล่ะมั้ง?",
        "Luca: …แล้วก็มีสาย LAN ต่อจาก Server ไปคอมเครื่องที่ว่า",
        "Momoka: อืมมมม… คงเป็นฝีมือ Wei ล่ะมั้ง ทำงานแนวเดียวกันนี่ ไม่งั้นก็คงมีคนแฮคแล้วล่ะ ฮ่าฮ่าฮ่า",
        "Luca: อ่า…ครับ",
        "Momoka: ถ้าสงสัยก็ลองไปถามเจ้าตัวดูสิกับตรวจ Log ต่อไปเรื่อยๆดูสิ",
        "Luca: ได้ครับ…",
        "Luca: (ถึงจะว่างั้นก็เถอะแต่ก็ไม่สบายใจอยู่ดี รู้สึกตะหงิดๆชอบกล)",
        "Momoka: อ้อ จะว่าไปนายได้ Keycard จาก Wei ไปรึยังน่ะ",
        "Luca: ครับ! นี่ไงครับ",
        "Momoka: อืมๆ งั้นก็ดีแล้วล่ะ",
        "Momoka: Momoka แค่เป็นห่วงว่า Wei จะลืมเอาให้ ยิ่งขี้ลืมอยู่ด้วย อึ๋ย เข้าตัวเองแฮะ",
        "Momoka: อะแฮ่มๆ เอาใหม่ๆ Momoka ก็กลัวว่านายจะทำงานได้ไม่เต็มที่เพราะจะเข้าห้อง Server ไม่ได้เท่านั้นเอง",
        "Luca: (คำอธิบายยาวแฮะ)",
        "Luca: เข้าห้องไม่ได้?",
        "Momoka: ใช่ เข้าไม่ได้เพราะ Keycard มีแค่ 3 ใบน่ะสิ ของ Momoka, Wei แล้วก็ของนาย"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ itsupport
        [NOTE] : minigame ไฟดับ | Objective เบรกเกอร์ชั้น G
       ------------------------------------------------------------------ */
    // 👥 [MULTIPLE CHARACTERS] : PART 1 - คุยกับ Wei ก่อน Momoka เดินเข้ามา
    public static final String[] DAY3_ITSUPPORT_PART1 = {
        "Luca: คุณ Wei ครับ คือผมมีเรื่องสงสัย",
        "Wei: ว่า…",
        "Luca: คุณ Wei ได้ต่อสาย LAN กับแก้ IP/DNS เครื่องคุณ Lauren ไหมครับ?",
        "Wei: เปล่า…",
        "Wei: อืม…สาย LAN กับ IP/DNS…",
        "Wei: อย่างกับมีคนจะแฮคแหนะ…"
    };

    // 👥 [MULTIPLE CHARACTERS] : PART 2 - เมื่อ Momoka เดินเข้ามาสมทบเรียบร้อยแล้ว
    public static final String[] DAY3_ITSUPPORT_PART2 = {
        "Momoka: ว่าไงจ๊ะ ผ่านไปตั้งหลายวันหาสาเหตุเน็ตช้าได้ยังเอ่ย",
        "Luca: (โอยยยตายย ลืมไปเลยว่าต้องแก้เน็ตช้า)",
        "Momoka: ไม่งั้นจะคิดว่ามีคนแฮคจริงๆแล้วนะ",
        "Wei: คิดเหมือนกันเลย…",
        "Momoka: ใช่ม้าๆ",
        "Luca: (พูดเรื่อง “แฮค” อีกแล้ว…)",
    };

    public static final String[] DAY3_ITSUPPORT_PART3 = {
            "Luca: !",
            "Luca: ไฟดับ!?",
            "Momoka: หวาา มืดอ่าา",
            "Luca: ควรลองลงไปดูตู้ไฟชั้น G ดูหน่อยดีมั้ยนะ",
            "Momoka: ขอนั่งอยู่นี่นะ Momoka กลัวสะดุดอ่ะ",
            "Wei: นายไปสิ",
            "Wei: Server ยังทำงานอยู่…"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ chiefoffice ( ถ้าช่วยจัดเอกสาร ครั้งที่ 3 )
       ------------------------------------------------------------------ */
    public static final String[] DAY3_CHIEFOFFICE = {
        "Momoka: อืม...",
        "Momoka: Momoka มีเรื่องสงสัยอยู่อย่าง",
        "Luca: อะไรหรอครับ?",
        "Momoka: นายดื่มแอลกกอฮอลล์เป็นมั้ย",
        "Momoka: Momoka ว่านายมาใหม่ทั้งทีเลยจะพาไปปาร์ตี้พบปะเพื่อนร่วมงาน",
        "Luca: งี้นี่เอง...",
        "Luca: ผมดื่-",
        "Momoka: อ๊ะแต่ดื่มไม่เป็นก็ไม่เห็นจะเป็นไรเลย! ยังไง Momoka ก็พาไปอยู่ดี",
        "Momoka: นี่ก็เพื่อ...นี่ก็เพื่อให้นายได้เจอทุกคนเลยนะ",
        "Momoka: มะ-ไม่ใช่ว่าเพราะอยากกินแบบหารกันอะไรเลยนะ!",
        "Luca: ครับ! แต่ปกติหัวหน้าต้องเป็นคนเลี้ยงนะครับ",
        "Momoka: เฮะ! จริงอ่ะ ม่ายยยยยน้าาาาาาาาาาาา"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR00 @ liftG
       ------------------------------------------------------------------ */
    public static final String[] DAY3_LIFTG = {
        "Shu: อ้าว คุณ Luca?",
        "Shu: มาเปิดเบรกเกอร์เองเลยหรอครับนี่",
        "Shu: คราวหลังไม่ต้องก็ได้นะครับ ปล่อยให้เป็นหน้าที่ของกระผมเอง",
        "Luca: (เออจริงด้วยหน้าที่เขานี่หว่า)",
        "Luca: อะฮะๆ รอบหน้าไม่แย่งงานคุณทำแล้วครับ…",
        "Luca: ว่าแต่ไหงไฟถึงดับได้ล่ะครับ",
        "Shu: ไฟคงจะกระชากน่ะครับ",
        "Shu: ช่วงนี้เกิดบ่อยเลย",
        "Luca: งั้นหรอครับ",
        "Luca: (จะว่าไปคุณ Shu เข้าไปทำความสะอาดห้อง Server ได้ยังไงนะ)",
        "Luca: (ไม่ใช่ว่ามีแค่ 3 ใบหรอกหรอ?)",
        "Luca: คุณ Shu ครับ ผมมีเรื่องสงสัย",
        "Luca: คุณเข้าไปทำความสะอาดห้อง Server ได้ยังไงหรอครับ?",
        "Shu: …",
        "Luca: มันมีแค่ 3 ใบนะครับ",
        "Shu: อ้อ คุณ Luca รู้เรื่อง Keycard แล้วสินะครับ",
        "Shu: พอดีว่าคุณหัวหน้าสาขาลืมอนุมัติ Keycard ให้ผมสักที ผมเลย “ยืม” มาจากคุณ Wei น่ะครับ",
        "Luca: อย่างนี้นี่เอง…",
        "Shu: กระผมคิดมาสักพักแล้วว่าขอเรียกคุณว่า Luca เฉยๆได้รึเปล่า",
        "Luca: ได้สิครับ",
        "Shu: งั้น Luca เองก็เรียกกระผมด้วยชื่อได้นะครับ กระผมไม่ถือเรื่องอายุหรอก พูดสบายๆเถอะครับ",
        "Shu: พวกเราคงได้เจอกันอีกบ่อยๆ ก็มาสนิทกันไว้ดีกว่าครับ",
        "Luca: เอออ งั้นขอเรียกว่า Shu นะครับ…",
        "Luca: Shu ผมกลับไปทำงานก่อนนะ ไว้เจอกัน",
        "Shu: โชคดีนะครับ"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ server
       ------------------------------------------------------------------ */
    public static final String[] DAY3_SERVER = {
        "Luca: มาอีกแล้ว…",
        "Luca: มาช่วงเดียวกับตอนไฟดับเลย",
        "Luca: จะใช่เรื่องบังเอิญแน่หรอ…"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : ชื่อรูป (CG ห้องนอน)
    ------------------------------------------------------------------ */
    public static final String[] DAY3_BEDROOM = {
        "Luca: วันนี้ก็มีเรื่องวุ่นๆอีกแล้วสิ",
        "Luca: ช่วงเวลาไฟดับมันตรงกับเวลาที่มีการพยายามเข้าถึงพอดิบพอดี",
        "Luca: นี่มันเหมาะเจาะเกินไป",
        "Luca: ถ้าดูจากเรื่องที่เจอตั้งแต่วันแรก",
        "Luca: รู้สึกว่ามีใครบางคนกำลังแฮคอยู่เลย",
        "ในความฝันมีคนบอกคุณว่า...",
        "บางทีงานที่ได้มาก็สำคัญอย่ามัวแต่เถลไถลไม่งั้นจะโดนไล่ออก"
    };

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                            OFFICE_DAY4                               ║
    // ╚══════════════════════════════════════════════════════════════════════╝

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ lift1
       ------------------------------------------------------------------ */
    public static final String[] DAY4_LIFT1 = {
        "Luca: หัวหน้าครับ!!!",
        "Momoka: หวาาา…อะไรหรอ",
        "Luca: ขอโทษครับ…เสียงดังไปหน่อย  คือผมคิดว่ามีคนกำลังขโมยข้อมูลบริษัทอยู่ครับ",
        "Momoka: เรื่องที่นายบอกเมื่อวานสินะ",
        "Momoka: อันที่จริงมันก็เป็นไปได้จริงๆนั่นแหละ…",
        "Luca: ผมเลยอยากขอไล่เช็คสาย LAN ทั้งหมดเลยน่ะครับ",
        "Momoka: เอาสิ งั้นฝากด้วยนะ"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ server
       ------------------------------------------------------------------ */
    public static final String[] DAY4_SERVER = {
        "Luca: เอ่อ สายนี้ไปตรงนี้…",
        "Luca: ส่วนสายนี้…",
        "Luca: !?",
        "Luca: มีจริงๆด้วยแฮะ \"Bridge\" น่ะ ",
        "คุณพบอุปกรณ์ Network Bridge ตัวรับ-ส่งข้อมูล",
        "Luca: มีคนกำลังแฮคอยู่จริงๆด้วย…",
        "มันรับ-ส่งข้อมูลข้อมูลจาก Server ส่งข้อมูลไปหาคนร้าย",
        "Luca: ต้องไปบอกเรื่องนี้กับหัวหน้า"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ chiefoffice
       ------------------------------------------------------------------ */
    public static final String[] DAY4_CHIEFOFFICE = {
        "Luca: หัวหน้าครับ หัวหน้า! ผมเจอ Bridge เชื่อมอยู่!",
        "Momoka: หืม? มีคนแฮคอยู่จริงๆด้วย",
        "Luca: ผมควรจะทำยังไงดีครับ?",
        "Momoka: ไม่ต้องทำอะไร",
        "Luca: เอ๊ะ? ทำไมล่ะครับ???",
        "Momoka: เฮ้อ เราจะดักจับคนร้ายกัน",
        "Momoka: Momoka ว่าคนร้ายอยู่ในตึกนี้",
        "Luca: …",
        "Momoka: บางทีนายแค่ลองหลอกถามทุกคนที่เจอเพื่อหาเบาะแสดู",
        "Momoka: ขอเตือนนายไว้อย่าง อย่าเชื่อใจใครเด็ดขาด ระวังตัวด้วย",
        "Luca: (เพิ่งเคยเห็นเธอจริงจังขนาดนี้ครั้งแรกเลย)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ itsupport
       ------------------------------------------------------------------ */
    public static final String[] DAY4_ITSUPPORT = {
        "Luca: คุณ Wei Keycard อยู่กับตัวรึเปล่าครับ?",
        "Wei: หืม…ก็วางไว้นี่ตลอดนะ",
        "Luca: เคยมีใคร “ยืม” ไปไหมครับ",
        "Wei: ไม่",
        "Luca: (ไม่เคยมีใครยืมหรอ? แล้วที่ Shu บอกว่ายืมไปล่ะ หมายความว่าไงกัน)",
        "Luca: วางไว้นี่ตลอดเลยหรอครับ?",
        "Wei: ใช่…",
        "Luca: แล้วเคยทำหายไหมครับ?",
        "Wei: อืม…เคย…แต่เดี๋ยวมันก็กลับมาเอง",
        "Luca: กลับมาเอง?",
        "Wei: วางที่เดิม…",
        "Luca: (วางที่เดิมเอง… นี่คือ “ยืม” ที่ว่างั้นหรอ)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR02 @ office
       ------------------------------------------------------------------ */
    public static final String[] DAY4_OFFICE = {
        "Luca: สวัสดีครับพี่ Lauren!  มีทำ OT บ่อยจังเลยนะครับ",
        "Luca: (หลอกถามดูๆ)",
        "Luca: ผมเจอไฟล์แปลกๆส่งมาจากแผนกพี่หลายวันแล้ว",
        "Luca: ว่าจะถามหลายครั้งแล้วแต่ลืมตลอดเลย พี่พอรู้เรื่องไหมครับ?",
        "Lauren: …",
        "Lauren: ค่ะ ที่น้องเจอพี่ทำเองค่ะ",
        "Lauren: ก่อนวันที่น้องจะเข้า พี่เผลอส่งไฟล์ผิด ไปครั้งนึง",
        "Luca: แล้วพี่ได้ส่งไฟล์ไปเพิ่มอีกไหมครับ?",
        "Lauren: ไม่มีแล้วนะคะ หลังจากนั้นพี่ก็ไม่ได้ส่งไฟล์อะไรอีกเลยค่ะ",
        "Luca: (ส่งแค่วันเดียวงั้นหรอ อืม…)"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR00 @ restroom
       ------------------------------------------------------------------ */
    public static final String[] DAY4_RESTROOM = {
        "Shu: ไงครับ Luca",
        "Luca: (นั่น Shu นี่! ว่าแต่ควรจะถามอะไรเขาดีล่ะ?)",
        "Shu: …",
        "Shu: มีเรื่องข้องใจอะไร อยากถามกระผมรึเปล่าครับ",
        "Luca: อะ!…อ่าาา",
        "Luca: (คนอะไรอ่านใจได้!)",
        "Luca: …ก็อยากจะถามนะครับ แต่ไม่รู้จะถามเรื่องอะไร…",
        "Shu: คิกคิก แปลกคนจังนะครับ มีเรื่องสงสัยแต่ไม่รู้จะถามอะไร",
        "Luca: ผมอยากจะเชื่อนะ…ว่า Shu เป็นคนดี…",
        "Shu: …",
        "Shu: จะเชื่อแบบนั้นก็ได้นะครับ เพราะกระผมจะทำดีกับคุณเสมอ",
        "Shu: ก็คุณเป็นเพื่อนร่วมงานของกระผมนี่นา",
        "Luca: ครับ…งั้นผมไปนะครับ",
        "Shu: ครับ",
        "Shu: …",
        "Shu: Luca",
        "Shu: ไม่ว่าจะเจอเรื่องแบบไหน กระผมจะเป็นกำลังใจให้นะครับ",
        "Luca: …"
    };

    /* ------------------------------------------------------------------
        [NOTE] : ตี 5 หลังเล่น minigame Log
       ------------------------------------------------------------------ */
    public static final String[] DAY4_LOG = {
        "**เสียงรอสายโทรศัพท์**",
        "Luca: …",
        "Momoka: ฮัลโหล?",
        "คุณเล่าทุกอย่างที่รู้ให้หัวหน้าฟัง"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : ชื่อรูป (CG ห้องนอน)
    ------------------------------------------------------------------ */
    public static final String[] DAY4_BEDROOM = {
        "Luca: ตอนนี้ชัดเจนแล้ว",
        "Luca: คนที่ขโมยข้อมูลจาก Server",
        "Luca: คนที่เข้าได้ทุกที่…",
        "Luca: คนที่อยู่ในวันที่ไฟดับ…",
        "Luca: คนที่คุยด้วยตลอด…",
        "Luca: จะต้องจับให้ได้เลย…",
        "Luca: …",
        "ในความฝันมีคนบอกคุณว่า...",
        "...",
        "ครั้งนี้ไม่มีใครอยู่ในฝันของคุณเลย"
    };

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                            OFFICE_DAY5                               ║
    // ╚══════════════════════════════════════════════════════════════════════╝

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR01 @ lift1
       ------------------------------------------------------------------ */
    public static final String[] DAY5_LIFT1 = {
        "คืนนี้สำนักงานเงียบกว่าปกติ",
        "คุณเจอหัวหน้า Momoka อยู่ที่ทางเข้า",
        "วันนี้สีหน้าเธอดูจริงจังกว่าทุกที",
        "Momoka: มาแล้วสินะ Momoka ไปคุยกับ Wei มาแล้ว",
        "Momoka: คืนนี้เราจะจับคนร้ายกัน",
        "Momoka: คนที่นายก็รู้ว่าใคร",
        "Momoka: นายก็ทำงานตามปกติของนายไป",
        "Momoka: แค่ตอนตี 3 ไปเจอกันที่ที่นัดไว้"
    };

    /* ------------------------------------------------------------------
        [MAP]  : MAP_FLOOR00 @ restroom
        [NOTE] : หลังเข้าไปในห้องน้ำ Lock ให้หยุดนิ่งห่างจาก Shu ประมาณนึง
       ------------------------------------------------------------------ */
    // 👥 [MULTIPLE CHARACTERS] : PART 1 - เผชิญหน้ากับ Shu
    public static final String[] DAY5_RESTROOM_PART1 = {
        "Luca: …",
        "Shu: อ้าว Luca?",
        "Shu: ทำหน้าเครียดมาเชียว มีเรื่องอะไรหรือครับ?",
        "Luca: …"
    };

    // 👥 [MULTIPLE CHARACTERS] : PART 2 - เมื่อ Momoka และ Wei เดินมาสมทบเรียบร้อยแล้ว
    public static final String[] DAY5_RESTROOM_PART2 = {
        "Shu: แหม…มีเรื่องอะไรกันหรอครับมากันครบเชียว",
        "Luca: พวกเรารู้แล้วนะครับ Shu…",
        "Shu: ครับ? เรื่องอะไรครับ?",
        "Luca: เรื่องที่คุณใช้ Keycard ของคุณ Wei เพื่อเข้าห้อง Server",
        "Shu: ก็ทำความสะอาดไงครับ กระผมบอกคุณเองแท้ๆ",
        "Luca: เรื่องที่คุณจงใจทำให้ไฟดับ",
        "Shu: ก็แค่ไฟกระชากเองครับ",
        "Luca: เรื่องที่คุณเปลี่ยน IP/DNS เครื่องของคุณ Lauren",
        "Shu: …",
        "Shu: กระผมจะทำไปเพื่ออะไรกันครับ?",
        "Luca: เพื่อขโมยข้อมูลจาก Server ไงครับ",
        "Shu: กระผมเป็นเพียงภารโรงนะครับ จะทำได้อย่างไร?",
        "Luca: ผมเจอ Bridge แล้วนะครับ",
        "Shu: …",
        "Luca: ทำไมคุณไม่ปฎิเสธไปล่ะครับว่าไม่ได้ทำ",
        "Shu: …",
        "Momoka: Shu พวกเราแจ้งตำรวจไว้แล้ว",
        "Shu: หัวหน้าสาขา…",
        "Shu: งั้น คุณ Wei ล่ะครับ คิดว่ากระผมเป็นคนร้ายเหมือนกันหรอ?",
        "Wei: …",
        "Shu: งั้นหรอครับ…",
        "Momoka:  นายก็หลุดปากออกมาแล้วนี่ว่าตัวเองเป็นคนร้าย",
        "Shu: …",
        "Shu: แหม โดนจับได้เสียแล้ว",
        "Shu: ทั้งๆที่กระผมก็วางแผนมาอย่างดีแล้วแท้ ทำไมกันล่ะครับ Luca?",
        "Shu: ทำไมถึงรู้ว่าเป็นกระผม?",
        "Luca: เพราะคุณ Lauren ลืมปิดคอม ผมเลยถือโอกาสเช็คเน็ตแล้วไปเจอเข้า",
        "Luca: ผมรู้สึกว่ามีเรื่องแปลกๆเลยไล่เช็คสาย LAN ทั่วทั้งตึก",
        "Luca: ถึงได้เจอ Bridge เข้า",
        "Shu: แล้วทำไมถึงไม่คิดว่าคุณ Wei เป็นคนร้ายล่ะครับ?",
        "Luca: เพราะตอนไฟดับเขาอยู่กับผมครับ ",
        "Momoka: Momoka เองก็อยู่ด้วย ไม่มีทางที่จะเป็นคนร้ายได้หรอก",
        "Shu: งั้นคุณ Lauren ล่ะครับ แพะที่กระผมเตรียมไว้ คุณไม่สนใจหน่อยหรอ?",
        "Luca: ตอนแรกก็คิดว่าเป็นเธอครับ แต่วันที่ไฟดับเธอไม่อยู่ ไม่มีทางดึงข้อมูลได้หรอกครับ",
        "Shu: นี่กระผมพลาดไปสินะ…",
        "Shu: คิกๆๆ กระผมถูกจับได้เพียงเพราะมีคนลืมปิดคอมเนี่ยนะ",
        "**เสียงไซเรนตำรวจ**",
        "Shu: แต่ไม่คิดเลยว่าจะมีใครไล่สาย LAN ทั้งตึก…",
        "Shu: แบบคุณ",
        "Shu: วันนี้ช่างสนุกเสียจริง"
    };

    // ╔══════════════════════════════════════════════════════════════════════╗
    // ║                             END_DAY                                  ║
    // ╚══════════════════════════════════════════════════════════════════════╝
    
    /* ------------------------------------------------------------------
        [CUTSCENE] : ชื่อรูป (CG จับคนร้ายได้)
    ------------------------------------------------------------------ */
    public static final String[] ENDING_CAUGHT = {
        "Momoka: คนร้ายคือ Shu เองหรอเนี่ย",
        "Wei: ตกใจเลย…",
        "Luca: นะ-นี่เขายิ้มงั้นหรอ",
        "Luca: (น่ากลัวชะมัด…)"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : CG-ending-chief (CG ending boss)
    ------------------------------------------------------------------ */
    public static final String[] ENDING_CHIEF = {
        "Momoka: หลังผ่านเรื่องวุ่นๆมา วันนี้สงบดีจังน้า",
        "Momoka:  Momoka ชอบเวลาแบบนี้นะ",
        "Momoka: เพราะหลังจากนั้นบริษัทก็อยู่วุ่นวายอยู่พักใหญ่เลย ฮืออ",
        "Luca:  แต่ก็จบลงด้วยดีนะครับ",
        "Momoka: เพราะเธอเลยนะ…",
        "Luca: ผมก็แค่ทำตามหน้าที่ของผม อีกอย่างหัวหน้าก็ช่วยผมตั้งเยอะแหน่ะ",
        "Momoka: ไม่หรอกน่าๆ อึก",
        "Momoka: Momoka ดื่มให้นายเลย! ฉลองกันๆ!",
        "Momoka: เย่!",
        "Luca: หัวหน้า Momoka… เมาแอ๋แล้ว…",
        "Momoka: จริงๆแล้ว Momoka ว่านายเหมาะกับงานนี้มากเลยนาา อึก",
        "Luca: งานกะกลางคืนน่ะเหรอครับ?",
        "Momoka: ม่ายช่ายๆ…อึก งานตามตามล้างตามเช็ดแก้ปัญหา",
        "Luca: …",
        "Luca: อย่างกับภารโรงยังไงอย่างนั้น",
        "Momoka: เหอะๆ ในโลก IT น่ะน้าา",
        "Momoka: บางครั้งศัตรูก็ไม่ได้เดินเข้ามาทางประตูหน้าเสมอไป…",
        "Luca: บางทีอาจจะถือไม้ถูพื้นเข้ามาก็ได้",
        "Momoka: …ฮ่า",
        "Momoka: พูดแบบนั้น…เดี๋ยว Momoka จะหลอนเอา",
        "Luca: อ๊ะ ขอโทษครับ",
        "Momoka: แต่ไม่เป็นไรหรอก คิกคิก ",
        "Momoka: คืนนี้…",
        "Momoka: ฉันขอดื่มให้เธอละกันนะ <3"
    };

    /* ------------------------------------------------------------------
        [CUTSCENE] : CG-ending-Janitor (CG ending janitor)
    ------------------------------------------------------------------ */
    public static final String[] ENDING_JANITOR = {
        "Luca: ถึงห้องสักที…ขอนอนหลักเต็มอิ่มที่เถอะ",
        "Luca: ?",
        "**เสียงของตก**",
        "Luca: เดี๋ยวนะ… เสียงจากในห้อง?",
        "**เสียงเปิดประตู**",
        "Luca: เฮ้ย!? นี่นาย!",
        "Shu: อะไรกันๆ… ตกใจอะไรขนาดนั้นล่ะครับ Luca",
        "Luca: S-Shu นายควรจะอยู่ในคุกไม่ใช่เหรอ!?",
        "Shu: อืม…ก็ใช่อยู่นะครับ เพียงแต่…",
        "Shu: กระผมคิดถึงคุณเลยมาหา",
        "Luca: ???",
        "Luca: ผมควรตกใจคุณหรือคำหยอดของคุณดีเนี่ย???",
        "Luca: ไม่ใช่สิ! ผมควรเรียกตำรวจนี่นา!",
        "Shu: อะฮ่าฮ๋า Luca นี่มีอารมณ์ขันดีนะครับ",
        "Shu: กระผมล้อเล่นน่า วันนี้กระผมไม่ได้มาทำอะไรคุณหรอก…",
        "Luca: งั้นนายมาทำอะไร!?",
        "Shu: มาขอบคุณครับ",
        "Luca: …",
        "Luca: …ห๊ะ?",
        "Shu: ก็คุณน่ะเป็นคนแรกเลย ที่สังเกตเห็นตัวตนที่แท้จริงของกระผม",
        "Shu: กระผมรู้สึกดีมากที่ได้เจอคุณ กระผมปลื้มคุณมากเลยนะ",
        "Luca: แล้วตอนนี้นายต้องการอะไร",
        "Shu: แค่จะมาบอกว่า…",
        "Shu: เกมนี้มันยังไม่จบหรอกนะ Luca…",
        "Shu: เพราะกระผมจะกลับมาอีกครั้งอย่างแน่นอน ตั้งตารอได้เลย",
        "Luca: …",
        "Shu: ไว้มาเล่นกันใหม่นะ คุณ L u c a"
    };
}